# I Thought It would be fun to turn the well-know Titanic data set into sql and analyze it

In [530]:
import pandas as pd
from sqlalchemy import create_engine

In [531]:
titanic = pd.read_csv('train.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<b>VARIABLE DESCRIPTION</b> <br><br>
PassengerId: is differetn id for each passenger><br>
survival didthe passenger survive 0 = No, 1 = Yes<br>
pclass Ticket class	1 = 1st, 2 = 2nd, 3 = 3rd<br>
sex	Sex	male or female <br>
Age	how old the passenger is in years	 <br>
sibsp # of siblings / spouses aboard the Titanic	 <br>
parch # of parents / children aboard the Titanic	 <br>
ticket Ticket number	 <br>
fare How much the passenger paid for thier ticket	 <br>
cabin Cabin number	 <br>
embarked Port of Embarkation C = Cherbourg, Q = Queenstown, S = Southampton <br>

In [532]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [533]:
#dropping Cabin Column because too much data missing
titanic = titanic.drop(columns=['Cabin'])

In [534]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [535]:
engine = create_engine('sqlite:///:memory:', echo=True)
conn = engine.connect()

In [536]:
sqlite_table = "td"
titanic.to_sql(sqlite_table, conn)

2023-08-16 17:56:15,158 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-08-16 17:56:15,159 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("td")
2023-08-16 17:56:15,159 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-08-16 17:56:15,160 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("td")
2023-08-16 17:56:15,160 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-08-16 17:56:15,161 INFO sqlalchemy.engine.Engine
CREATE TABLE td (
	"index" BIGINT,
	"PassengerId" BIGINT,
	"Survived" BIGINT,
	"Pclass" BIGINT,
	"Name" TEXT,
	"Sex" TEXT,
	"Age" FLOAT,
	"SibSp" BIGINT,
	"Parch" BIGINT,
	"Ticket" TEXT,
	"Fare" FLOAT,
	"Embarked" TEXT
)


2023-08-16 17:56:15,161 INFO sqlalchemy.engine.Engine [no key 0.00018s] ()
2023-08-16 17:56:15,161 INFO sqlalchemy.engine.Engine CREATE INDEX ix_td_index ON td ("index")
2023-08-16 17:56:15,161 INFO sqlalchemy.engine.Engine [no key 0.00019s] ()
2023-08-16 17:56:15,165 INFO sqlalchemy.engine.Engine INSERT INTO td ("index", "PassengerId", "Survived", "Pclass", "Name", "Sex", "Age", "SibSp", "Parch", "Ticket", "Fare", "Embarked") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2023-08-16 17:56:15,166 INFO sqlalchemy.engine.Engine [generated in 0.00267s] [(0, 1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0, 'A/5 21171', 7.25, 'S'), (1, 2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C'), (2, 3, 1, 3, 'Heikkinen, Miss. Laina', 'female', 26.0, 0, 0, 'STON/O2. 3101282', 7.925, 'S'), (3, 4, 1, 1, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'female', 35.0, 1, 0, '113803', 53.1, 'S'), (4, 5, 0, 3, 'Allen, Mr. William Henry', 'male', 35.0, 0, 0, '373450', 8.05, 'S'), (5, 6, 0, 3, 'Moran, Mr. James', 'male', None, 0, 0, '330877', 8.4583, 'Q'), (6, 7, 0, 1, 'McCarthy, Mr. Timothy J', 'male', 54.0, 0, 0, '17463', 51.8625, 'S'), (7, 8, 0, 3, 'Palsson, Master. Gosta Leonard', 'male', 2.0, 3, 1, '349909', 21.075, 'S')  ... displaying 10 of 891 total bound parameter sets ...  (889, 890, 1, 1, 'Behr, Mr. Karl Howell', 'male', 26.0, 0, 0, '111369', 30.0, 'C'), (890, 891, 0, 3, 'Dooley, Mr. Patrick', 'male', 32.0, 0, 0, '370376', 7.75, 'Q')]
2023-08-16 17:56:15,171 INFO sqlalchemy.engine.Engine COMMIT

891

In [537]:
sql = '''SELECT * FROM td'''
df = pd.read_sql_query(sql, conn)
df.head()

2023-08-16 17:56:15,175 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-08-16 17:56:15,176 INFO sqlalchemy.engine.Engine SELECT * FROM td
2023-08-16 17:56:15,176 INFO sqlalchemy.engine.Engine [raw sql] ()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

# lets see what percentage of people survived the crash.

In [538]:
sql = '''SELECT ROUND(SUM(Survived) * 100.0 / COUNT(Survived),1) as 'Percentage Survived' FROM td'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,185 INFO sqlalchemy.engine.Engine SELECT ROUND(SUM(Survived) * 100.0 / COUNT(Survived),1) as 'Percentage Survived' FROM td
2023-08-16 17:56:15,186 INFO sqlalchemy.engine.Engine [raw sql] ()

   Percentage Survived
0                 38.4

In [539]:
#What percentage survived by age groups
sql = '''SELECT SUM(CASE WHEN Age < 18 THEN 1 ELSE 0 END) as Children,
(SELECT ROUND(SUM(Survived) * 100.0 / COUNT(*),1) FROM td WHERE Age < 18) as 'Perc Survived',
SUM(CASE WHEN Age > 17 and Age < 65 THEN 1 ELSE 0 END) as Adults,
(SELECT ROUND(SUM(Survived) * 100.0 / COUNT(*),1) FROM td WHERE Age > 17 and Age < 65) as 'Perc Survived',
SUM(CASE WHEN Age > 64 THEN 1 ELSE 0 END) as Elderly,
(SELECT ROUND(SUM(Survived) * 100.0 / COUNT(*),1) FROM td WHERE Age > 64) as 'Perc Survived'
FROM TD''' 
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,190 INFO sqlalchemy.engine.Engine SELECT SUM(CASE WHEN Age < 18 THEN 1 ELSE 0 END) as Children,
(SELECT ROUND(SUM(Survived) * 100.0 / COUNT(*),1) FROM td WHERE Age < 18) as 'Perc Survived',
SUM(CASE WHEN Age > 17 and Age < 65 THEN 1 ELSE 0 END) as Adults,
(SELECT ROUND(SUM(Survived) * 100.0 / COUNT(*),1) FROM td WHERE Age > 17 and Age < 65) as 'Perc Survived',
SUM(CASE WHEN Age > 64 THEN 1 ELSE 0 END) as Elderly,
(SELECT ROUND(SUM(Survived) * 100.0 / COUNT(*),1) FROM td WHERE Age > 64) as 'Perc Survived'
FROM TD
2023-08-16 17:56:15,191 INFO sqlalchemy.engine.Engine [raw sql] ()

   Children  Perc Survived  Adults  Perc Survived  Elderly  Perc Survived
0       113           54.0     590           38.6       11            9.1

In [540]:
sql = '''SELECT Avg(Fare) FROM td'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,196 INFO sqlalchemy.engine.Engine SELECT Avg(Fare) FROM td
2023-08-16 17:56:15,197 INFO sqlalchemy.engine.Engine [raw sql] ()

   Avg(Fare)
0  32.204208

In [541]:
# Going to find what percentage of people survived by different fare amounts
sql = '''SELECT SUM(CASE WHEN Fare > 32 THEN 1 ELSE 0 END) as 'Rich People',
(SELECT ROUND(Sum(Survived)*100.0/Count(*),1) From td WHERE Fare > 32) as 'Perc Survived',
SUM(CASE WHEN Fare < 32 THEN 1 ELSE 0 END) as 'Poor People',
(SELECT ROUND(Sum(Survived)*100.0/Count(*),1) From td WHERE Fare < 32) as 'Perc Survived' 
FROM td'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,204 INFO sqlalchemy.engine.Engine SELECT SUM(CASE WHEN Fare > 32 THEN 1 ELSE 0 END) as 'Rich People',
(SELECT ROUND(Sum(Survived)*100.0/Count(*),1) From td WHERE Fare > 32) as 'Perc Survived',
SUM(CASE WHEN Fare < 32 THEN 1 ELSE 0 END) as 'Poor People',
(SELECT ROUND(Sum(Survived)*100.0/Count(*),1) From td WHERE Fare < 32) as 'Perc Survived'
FROM td
2023-08-16 17:56:15,205 INFO sqlalchemy.engine.Engine [raw sql] ()

   Rich People  Perc Survived  Poor People  Perc Survived
0          211           59.7          680           31.8

In [542]:
#what percentage survived male vs female
sql = '''SELECT Sex, COUNT(*) totalCount,ROUND(Sum(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Sex'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,213 INFO sqlalchemy.engine.Engine SELECT Sex, COUNT(*) totalCount,ROUND(Sum(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Sex
2023-08-16 17:56:15,215 INFO sqlalchemy.engine.Engine [raw sql] ()

      Sex  totalCount  Perc Survived
0  female         314           74.2
1    male         577           18.9

In [543]:
#what percentage survived In Different Pclasses
sql = '''SELECT Pclass, COUNT(*) totalCount,ROUND(Sum(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Pclass'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,222 INFO sqlalchemy.engine.Engine SELECT Pclass, COUNT(*) totalCount,ROUND(Sum(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Pclass
2023-08-16 17:56:15,223 INFO sqlalchemy.engine.Engine [raw sql] ()

   Pclass  totalCount  Perc Survived
0       1         216           63.0
1       2         184           47.3
2       3         491           24.2

In [544]:
#what percentage survived In Different Pclasses by sex
sql = '''SELECT Sex,Pclass, COUNT(*) totalCount,ROUND(Sum(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Pclass,Sex'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,229 INFO sqlalchemy.engine.Engine SELECT Sex,Pclass, COUNT(*) totalCount,ROUND(Sum(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Pclass,Sex
2023-08-16 17:56:15,230 INFO sqlalchemy.engine.Engine [raw sql] ()

      Sex  Pclass  totalCount  Perc Survived
0  female       1          94           96.8
1    male       1         122           36.9
2  female       2          76           92.1
3    male       2         108           15.7
4  female       3         144           50.0
5    male       3         347           13.5

In [545]:
#what percentage survived by parch amount
sql = '''SELECT Parch, COUNT(*) totalCount,ROUND(SUM(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Parch'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,236 INFO sqlalchemy.engine.Engine SELECT Parch, COUNT(*) totalCount,ROUND(SUM(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Parch
2023-08-16 17:56:15,236 INFO sqlalchemy.engine.Engine [raw sql] ()

   Parch  totalCount  Perc Survived
0      0         678           34.4
1      1         118           55.1
2      2          80           50.0
3      3           5           60.0
4      4           4            0.0
5      5           5           20.0
6      6           1            0.0

In [546]:
#percentage survived with and w/o parents or children
sql = '''SELECT SUM(CASE WHEN Parch = 0 THEN 1 ELSE 0 END) as 'w/o parents/siblings',
(SELECT ROUND(SUM(Survived)*100.0/Count(*),1) FROM td WHERE Parch = 0) as 'Perc Survived',
SUM(CASE WHEN Parch > 0 THEN 1 ELSE 0 END) as 'with parents/siblings',
(SELECT ROUND(SUM(Survived)*100.0/Count(*),1) FROM td WHERE Parch > 0) as 'Perc Survived'
FROM td'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,241 INFO sqlalchemy.engine.Engine SELECT SUM(CASE WHEN Parch = 0 THEN 1 ELSE 0 END) as 'w/o parents/siblings',
(SELECT ROUND(SUM(Survived)*100.0/Count(*),1) FROM td WHERE Parch = 0) as 'Perc Survived',
SUM(CASE WHEN Parch > 0 THEN 1 ELSE 0 END) as 'with parents/siblings',
(SELECT ROUND(SUM(Survived)*100.0/Count(*),1) FROM td WHERE Parch > 0) as 'Perc Survived'
FROM td
2023-08-16 17:56:15,242 INFO sqlalchemy.engine.Engine [raw sql] ()

   w/o parents/siblings  Perc Survived  with parents/siblings  Perc Survived
0                   678           34.4                    213           51.2

In [547]:
#what percentage survived by Sibsp amount
sql = '''SELECT Sibsp, COUNT(*) totalCount,ROUND(SUM(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Sibsp'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,247 INFO sqlalchemy.engine.Engine SELECT Sibsp, COUNT(*) totalCount,ROUND(SUM(Survived)*100.0/Count(*),1) as 'Perc Survived'
FROM td
GROUP BY Sibsp
2023-08-16 17:56:15,247 INFO sqlalchemy.engine.Engine [raw sql] ()

   SibSp  totalCount  Perc Survived
0      0         608           34.5
1      1         209           53.6
2      2          28           46.4
3      3          16           25.0
4      4          18           16.7
5      5           5            0.0
6      8           7            0.0

In [549]:
#percentage survived with and w/o parents or siblings
sql = '''SELECT SUM(CASE WHEN Sibsp = 0 THEN 1 ELSE 0 END) as 'w/o parents/siblings',
(SELECT ROUND(SUM(Survived)*100.0/Count(*),1) FROM td WHERE Sibsp = 0) as 'Perc Survived',
SUM(CASE WHEN Sibsp > 0 THEN 1 ELSE 0 END) as 'with parents/siblings',
(SELECT ROUND(SUM(Survived)*100.0/Count(*),1) FROM td WHERE Sibsp > 0) as 'Perc Survived'
FROM td'''
df = pd.read_sql_query(sql, conn)
df

2023-08-16 17:56:15,259 INFO sqlalchemy.engine.Engine SELECT SUM(CASE WHEN Sibsp = 0 THEN 1 ELSE 0 END) as 'w/o parents/siblings',
(SELECT ROUND(SUM(Survived)*100.0/Count(*),1) FROM td WHERE Sibsp = 0) as 'Perc Survived',
SUM(CASE WHEN Sibsp > 0 THEN 1 ELSE 0 END) as 'with parents/siblings',
(SELECT ROUND(SUM(Survived)*100.0/Count(*),1) FROM td WHERE Sibsp > 0) as 'Perc Survived'
FROM td
2023-08-16 17:56:15,259 INFO sqlalchemy.engine.Engine [raw sql] ()

   w/o parents/siblings  Perc Survived  with parents/siblings  Perc Survived
0                   608           34.5                    283           46.6

In [550]:
conn.close()

2023-08-16 17:56:15,264 INFO sqlalchemy.engine.Engine ROLLBACK